БИТУправление_медицинским_центром_демо/src/Catalogs/МедицинскиеОтчеты/МедицинскиеОтчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МедицинскиеОтчеты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Периоды</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОтчетИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОтчетХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОтчетВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИДОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/МедицинскийОтчет/МедицинскийОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МедицинскийОтчет</name>
  <comment>Медицинский отчет</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Вид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетности</name>
    <comment>Вид отчетности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбраннаяФорма</name>
    <comment>Выбранная форма</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <comment>Сохраненные данные отчета</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастройкиСтраниц</name>
    <comment>Дерево со списком настроек страниц</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОтчета</name>
    <comment>Имя встроенной или имя файла внешней обработки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтчета</name>
    <comment>Наименование медицинского отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеДанныеПодписанногоДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <comment>Документ подписан ЭЦП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Catalogs/МедицинскиеОтчеты/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РежимВыбора = Параметры.РежимВыбора;
		
	УстановитьВидимостьСпискаГруппСправочника();
	
	#Область РасширенныйФункционал
	МедицинскаяОтчетность.СправочникМедицинскиеОтчеты_ПриСозданииНаСервере(ЭтотОбъект);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.ТекущаяСтрока = НовыйОбъект;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовый(Команда)
	
	СоздатьНовыйОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы .Вставить("Отбор", Новый Структура("ИсточникОтчета", Элементы.Список.ТекущиеДанные.ИсточникОтчета));
	КонецЕсли;
	
	ОткрытьФорму("Документ.МедицинскийОтчет.ФормаСписка", ПараметрыФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ОткрытьФорму("Справочник.МедицинскиеОтчеты.ФормаОбъекта",, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьСпискаГруппСправочника()
	
	ЕстьГруппы = Ложь;
	
	Выборка = Справочники.МедицинскиеОтчеты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			ЕстьГруппы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Дерево.Видимость = ЕстьГруппы;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтчет(НаименованиеОтчета = Неопределено)
	Перем Расширение;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	МедицинскиеОтчеты.ЭтоГруппа КАК ЭтоГруппа,
		|	МедицинскиеОтчеты.ИсточникОтчета КАК ИсточникОтчета,
		|	МедицинскиеОтчеты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.МедицинскиеОтчеты КАК МедицинскиеОтчеты
		|ГДЕ
		|	МедицинскиеОтчеты.Ссылка = &ТекущаяСтрока
		|");
	
	Запрос.УстановитьПараметр("ТекущаяСтрока", Элементы.Список.ТекущаяСтрока);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Если Выборка.ЭтоГруппа Тогда
		Возврат "ЭтоГруппа";
	КонецЕсли;
	
	ФайлВнешнегоОтчета = Выборка.ИсточникОтчета;
	
	НаименованиеИзСправочника = Выборка.Наименование;
	МетаОтчет = Метаданные.Отчеты.Найти(ФайлВнешнегоОтчета);
	Если МетаОтчет <> Неопределено И МетаОтчет.ОсновнаяФорма <> Неопределено Тогда
			
		НаименованиеОтчета = МетаОтчет.ОсновнаяФорма.Синоним;
			
	Иначе
			
		НаименованиеОтчета = НаименованиеИзСправочника;
			
	КонецЕсли;
	
	ПравоДоступаКОтчету = МедицинскаяОтчетностьВызовСервера.ПравоДоступаКМедицинскомуОтчету(ФайлВнешнегоОтчета);
	Если ПравоДоступаКОтчету = Ложь Тогда
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Недостаточно прав.'");
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	ИначеЕсли ПравоДоступаКОтчету = Неопределено Тогда
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Отчет не найден.'");
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	Если Метаданные.Документы.Найти(ФайлВнешнегоОтчета) <> Неопределено Тогда // это внутренний отчет-документ
			
		ВнутреннийОтчет = Документы[ФайлВнешнегоОтчета];
		Возврат "Документ." + Сред(ВнутреннийОтчет, СтрНайти(ВнутреннийОтчет, ".") + 1) + ".Форма.ФормаДокумента";
			
	КонецЕсли;
	
	// Возвращает типы ВнешнийОтчетОбъект.<Имя> и ОтчетМенеджер.<Имя>
	ТекОтчет = МедицинскаяОтчетность.МедОтчеты(ФайлВнешнегоОтчета);
	Если ТекОтчет = Неопределено Тогда
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не удалось получить отчет.'");
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	// ВнешнийОтчетОбъект или ОтчетМенеджер
	Возврат ?(СтрНайти(ТекОтчет, "ОтчетМенеджер") > 0, "Отчет.", "ВнешнийОтчет.") + Сред(ТекОтчет, СтрНайти(ТекОтчет, ".") + 1) + ".Форма.ОсновнаяФорма";

КонецФункции

&НаКлиенте
Функция СоздатьНовыйОтчет()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Выберите отчет.'");
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НаименованиеОтчета = "";
	ТекФорма = ПолучитьОтчет(НаименованиеОтчета);
	
	Если ТекФорма = Неопределено
		ИЛИ ТекФорма = "ЭтоГруппа" Тогда
		Возврат ТекФорма;
	КонецЕсли;
	
	// Сначала попробуем найти его среди открытых стартовых форм.
	// Необходимо при работе под Веб-клиентом для предотвращения
	// открытия нескольких стартовых форм одного отчета
	НайденоОкно = Ложь;
	МедицинскаяОтчетностьКлиент.ВебКлиентНайтиАктивизироватьОкно(ТекФорма, ЭтаФорма, НайденоОкно);
	Если НайденоОкно <> Неопределено Тогда
		Если НайденоОкно Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	ТекФорма = ПолучитьФорму(ТекФорма, , ЭтаФорма, ТекФорма);
	
	Если ТекФорма = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не удалось открыть отчет.'");
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ТекФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ТекФорма.Открыть();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПодробнуюИнформацию(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(,НСтр("ru='Выберите отчет.'"));
		
		Возврат;
		
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
				
		ПоказатьПредупреждение(,НСтр("ru='Функция недоступна для группы отчетов.'"));
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", Элементы.Список.ТекущаяСтрока);
	
	ФормаПодробнееОФормах = МедицинскаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ПодробнееОбОтчете", ПараметрыФормы, ЭтаФорма);
	ФормаПодробнееОФормах.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаПодробнееОФормах.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.ТекущаяСтрока = НовыйОбъект;
		
КонецПроцедуры

#КонецОбласти
